app/controllers/api/v1/interests_controller.rb

    def index
        interests = Interest.all
---
SELECT "interests".* FROM "interests"