app/controllers/api/v1/users_controller.rb

INSERT INTO "users" ("name", "age", "gender", "smoker", "has_kids", "tagline", "image", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
---
    def create
        user = User.create(user_params)
        if user.save