app/controllers/api/v1/users_controller.rb

    def update
        array = params[:interests]
        array.map do |interest|
---
SELECT "interests".* FROM "interests"